Autodesk.Revit.DB.IExternalResourceServerInternal.GetExternalResourceReferenceFromModelPath(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.ExternalResourceType)
Implement this method to convert a given ModelPath (could be file path or cloud path) to an ExternalResourceReference.
Remarks:
This funcion is called only if canHandleModelPath() returns true.
If the local path cannot be handled by this server, null ExternalResourceReference will be returned.
modelPath:
The path to the external resource.
resourceType:
The external resource type should be matched by the ModelPath.
Returns:
The ExternalResourceReference converted with the given ModelPath.
Since:
2018

Autodesk.Revit.DB.IExternalResourceServerInternal.CanHandleModelPath(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.ExternalResourceType,System.Boolean)
Implement this method to indicate whether this sever can handle a given ModelPath (could be file path or cloud path),
which matches a given external resource type, if necessary.
Remarks:
A server cannot handle a given ModelPath, such as getExternalResourceReferenceFromModelPath()
if the given local path is outside of its cached path or the given one is invalid.
modelPath:
The path to the external resource.
resourceType:
The external resource type should be matched by the ModelPath.
isForFileOpen:
True if the operation is for Opening file; false if the operation is for linking.
Returns:
True if the server can handle a given ModelPath; false otherwise.
Since:
2018

Autodesk.Revit.DB.IExternalResourceServerInternal
Extends the interface of IExternalResourceServer and enable more functionality for external resource servers.
Remarks:
Currently, this extention allows the server to handle worksharing and applicable local paths.
it also enables the server to be hidden in UI.
Since:
2018